#Introduction to SQL and Advanced
#Functions | Assignment

Question 1 : Explain the fundamental differences between DDL, DML, and DQL
commands in SQL. Provide one example for each type of command.

Answer: DDL, DML, and DQL are distinct categories of SQL commands serving different purposes in database management.
1. DDL (Data Definition Language):
Purpose: DDL commands are used to define, modify, and delete the structure of database objects (like tables, views, indexes, schemas). They deal with the schema or structure of the database, not the data itself.
Impact: Changes made by DDL commands are permanent and automatically committed. They cannot be rolled back.
Example: Creating a new table.
Code

CREATE TABLE Students (
    StudentID INT PRIMARY KEY,
    FirstName VARCHAR(50),
    LastName VARCHAR(50),
    Age INT
);
2. DML (Data Manipulation Language):
Purpose: DML commands are used to manipulate the data within the database objects. They allow users to insert, update, or delete records in tables.
Impact: Changes made by DML commands are not automatically committed and can be rolled back using transaction control commands (like ROLLBACK).
Example: Inserting a new record into a table.
Code

INSERT INTO Students (StudentID, FirstName, LastName, Age)
VALUES (1, 'Alice', 'Smith', 20);
3. DQL (Data Query Language):
Purpose: DQL commands are used to retrieve data from the database. They allow users to query and fetch specific information based on defined criteria.
Impact: DQL commands do not modify the database structure or the data itself; they only retrieve information.
Example: Retrieving all records from a table.
Code

SELECT * FROM Students;

Question 2 : What is the purpose of SQL constraints? Name and describe three common types
of constraints, providing a simple scenario where each would be useful.

Answer: SQL constraints are rules applied to columns or tables in a database to enforce data integrity and maintain data accuracy and reliability. They ensure that data entered into the database adheres to specific criteria, preventing invalid or inconsistent data from being stored.
Here are three common types of constraints:
PRIMARY KEY Constraint:
Description: A PRIMARY KEY uniquely identifies each row in a table. It cannot contain NULL values and must be unique for each row. A table can only have one PRIMARY KEY.
Scenario: In a Customers table, the CustomerID column would typically be designated as the PRIMARY KEY. This ensures that every customer record is uniquely identifiable and that no two customers have the same CustomerID.
FOREIGN KEY Constraint:
Description: A FOREIGN KEY establishes a link between two tables. It refers to the PRIMARY KEY of another table, ensuring referential integrity by preventing actions that would destroy the links between tables.
Scenario: In an Orders table, the CustomerID column could be a FOREIGN KEY referencing the CustomerID (PRIMARY KEY) in the Customers table. This ensures that an order can only be placed by an existing customer and prevents the deletion of a customer record if there are associated orders.
NOT NULL Constraint:
Description: The NOT NULL constraint ensures that a column cannot contain NULL values. Every row must have a value in that specific column.
Scenario: In a Products table, the ProductName column would likely have a NOT NULL constraint. This ensures that every product entered into the database has a name, preventing records with missing product names.

Question 3 : Explain the difference between LIMIT and OFFSET clauses in SQL. How
would you use them together to retrieve the third page of results, assuming each page
has 10 records?

Answer: The LIMIT and OFFSET clauses in SQL are used to control the number of rows returned by a query and the starting point of those rows within the result set.
LIMIT: This clause restricts the maximum number of rows returned by a query. It specifies how many rows to include in the final result. For example, LIMIT 10 would return only the first 10 rows.
OFFSET: This clause specifies the number of rows to skip from the beginning of the result set before starting to return rows. It effectively "offsets" the starting point of the result. For example, OFFSET 20 would skip the first 20 rows and start returning results from the 21st row.
Using LIMIT and OFFSET for Pagination (Third Page of Results with 10 Records per Page):
To retrieve the third page of results, assuming each page has 10 records, the following SQL query structure can be used:
Code

SELECT *
FROM your_table_name
ORDER BY your_column_for_ordering -- Important for consistent results
LIMIT 10
OFFSET 20;
Explanation:
ORDER BY your_column_for_ordering: This is crucial for consistent pagination. Without an ORDER BY clause, the order of rows returned by the database is not guaranteed, meaning the "third page" could contain different records each time the query is executed. Replace your_column_for_ordering with the column(s) you want to use to sort your results (e.g., id, creation_date).
LIMIT 10: This specifies that only 10 records should be returned, which corresponds to the number of records on a single page.
OFFSET 20: To get the third page, you need to skip the records from the first two pages. Since each page has 10 records, the first two pages contain 2 * 10 = 20 records. Therefore, OFFSET 20 skips these initial 20 records, and the LIMIT 10 then retrieves the next 10 records, which constitute the third page.
General Formula for Pagination:
To retrieve the Nth page with P records per page:
Code

SELECT *
FROM your_table_name
ORDER BY your_column_for_ordering
LIMIT P
OFFSET (N - 1) * P;

Question 4 : What is a Common Table Expression (CTE) in SQL, and what are its main
benefits? Provide a simple SQL example demonstrating its usage.


Answer: A Common Table Expression (CTE) in SQL is a temporary, named result set that you can define within the execution scope of a single SQL statement (SELECT, INSERT, UPDATE, DELETE, or MERGE). It functions as a virtual table, created and used only for the duration of the query, and not stored permanently in the database. CTEs are initiated using the WITH clause.
Main Benefits of CTEs:
Improved Readability and Maintainability: CTEs allow you to break down complex queries into smaller, more logical, and understandable blocks. This modular approach makes the SQL code easier to read, debug, and maintain, especially in collaborative environments.
Reusability: You can define a CTE once and reference it multiple times within the same query, avoiding the repetition of subqueries and adhering to the DRY (Don't Repeat Yourself) principle.
Support for Recursive Queries: CTEs are essential for handling hierarchical or tree-structured data by enabling recursive queries, where a CTE can reference itself to traverse through levels of a hierarchy (e.g., organizational charts, bill of materials).
Enhanced Organization: By separating complex logic into distinct CTEs, you can better organize your SQL statements, making the flow of data transformations more transparent.
Simple SQL Example Demonstrating CTE Usage:
Consider a table named Employees with columns EmployeeID, Name, Department, and Salary. We want to find the average salary per department and then list all employees whose salary is above their department's average.
Code

WITH DepartmentAverageSalary AS (
    SELECT
        Department,
        AVG(Salary) AS AvgSalary
    FROM
        Employees
    GROUP BY
        Department
)
SELECT
    e.Name,
    e.Department,
    e.Salary,
    das.AvgSalary
FROM
    Employees e
JOIN
    DepartmentAverageSalary das ON e.Department = das.Department
WHERE
    e.Salary > das.AvgSalary;
In this example, the DepartmentAverageSalary CTE calculates the average salary for each department. The main SELECT statement then joins the Employees table with this CTE to filter and display employees earning more than their department's average.

Question 5 : Describe the concept of SQL Normalization and its primary goals. Briefly
explain the first three normal forms (1NF, 2NF, 3NF).


Answer: SQL Normalization is a database design technique used to organize tables and columns to minimize data redundancy and improve data integrity. Its primary goals are:
Eliminate Data Redundancy: Reduce the storage of duplicate information, which saves space and prevents inconsistencies when data is updated.
Improve Data Integrity: Ensure the accuracy and consistency of data by establishing clear relationships and dependencies between data elements.
Enhance Data Consistency: Minimize the risk of update, insertion, and deletion anomalies that can occur with unnormalized data.
Increase Database Flexibility and Scalability: Make the database easier to modify and extend as requirements change.
Here are the first three normal forms:
First Normal Form (1NF):
Each table must have a primary key to uniquely identify each row.
Each column must contain atomic values, meaning there are no repeating groups or multi-valued attributes within a single cell.
Each column must have a unique name.
Second Normal Form (2NF):
The table must already be in 1NF.
All non-key attributes must be fully functionally dependent on the entire primary key. This means that if a table has a composite primary key, no non-key attribute can depend on only a part of that primary key.
Third Normal Form (3NF):
The table must already be in 2NF.
There should be no transitive dependencies. This means that no non-key attribute should be functionally dependent on another non-key attribute. In other words, all non-key attributes must directly depend on the primary key, and not indirectly through another non-key attribute.

Question 6 : Create a database named ECommerceDB and perform the following
tasks:
1. Create the following tables with appropriate data types and constraints:
● Categories
○ CategoryID (INT, PRIMARY KEY)
○ CategoryName (VARCHAR(50), NOT NULL, UNIQUE)
● Products
○ ProductID (INT, PRIMARY KEY)
○ ProductName (VARCHAR(100), NOT NULL, UNIQUE)
○ CategoryID (INT, FOREIGN KEY → Categories)
○ Price (DECIMAL(10,2), NOT NULL)
○ StockQuantity (INT)
● Customers
○ CustomerID (INT, PRIMARY KEY)
○ CustomerName (VARCHAR(100), NOT NULL)
○ Email (VARCHAR(100), UNIQUE)
○ JoinDate (DATE)
● Orders
○ OrderID (INT, PRIMARY KEY)
○ CustomerID (INT, FOREIGN KEY → Customers)
○ OrderDate (DATE, NOT NULL)
○ TotalAmount (DECIMAL(10,2))
2. Insert the following records into each table
● Categories
CategoryID Category Name
1 Electronics
2 Books
3 Home Goods
4 Apparel
● Products
ProductID ProductName CategoryID Price StockQuantity
101 Laptop Pro 1 1200.00 50
102 SQL
Handbook
2 45.50 200
103 Smart Speaker 1 99.99 150
104 Coffee Maker 3 75.00 80
105 Novel : The
Great SQL
2 25.00 120
106 Wireless
Earbuds
1 150.00 100
107 Blender X 3 120.00 60
108 T-Shirt Casual 4 20.00 300
● Customers
CustomerID CustomerName Email Joining Date
1 Alice Wonderland alice@example.com 2023-01-10
2 Bob the Builder bob@example.com 2022-11-25
3 Charlie Chaplin charlie@example.com 2023-03-01
4 Diana Prince diana@example.com 2021-04-26
● Orders
OrderID CustomerID OrderDate TotalAmount
1001 1 2023-04-26 1245.50
1002 2 2023-10-12 99.99
1003 1 2023-07-01 145.00
1004 3 2023-01-14 150.00
1005 2 2023-09-24 120.00
1006 1 2023-06-19 20.00


Answer: -- Create the database
CREATE DATABASE ECommerceDB;
USE ECommerceDB;

-- 1. Create the tables

-- Categories Table
CREATE TABLE Categories (
    CategoryID INT PRIMARY KEY,
    CategoryName VARCHAR(50) NOT NULL UNIQUE
);

-- Products Table
CREATE TABLE Products (
    ProductID INT PRIMARY KEY,
    ProductName VARCHAR(100) NOT NULL UNIQUE,
    CategoryID INT,
    Price DECIMAL(10,2) NOT NULL,
    StockQuantity INT,
    FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);

-- Customers Table
CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(100) NOT NULL,
    Email VARCHAR(100) UNIQUE,
    JoinDate DATE
);

-- Orders Table
CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    OrderDate DATE NOT NULL,
    TotalAmount DECIMAL(10,2),
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);

-- 2. Insert the records into each table

-- Insert data into Categories
INSERT INTO Categories (CategoryID, CategoryName) VALUES
(1, 'Electronics'),
(2, 'Books'),
(3, 'Home Goods'),
(4, 'Apparel');

-- Insert data into Products
INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES
(101, 'Laptop Pro', 1, 1200.00, 50),
(102, 'SQL Handbook', 2, 45.50, 200),
(103, 'Smart Speaker', 1, 99.99, 150),
(104, 'Coffee Maker', 3, 75.00, 80),
(105, 'Novel : The Great SQL', 2, 25.00, 120),
(106, 'Wireless Earbuds', 1, 150.00, 100),
(107, 'Blender X', 3, 120.00, 60),
(108, 'T-Shirt Casual', 4, 20.00, 300);

-- Insert data into Customers
INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES
(1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
(2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
(3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
(4, 'Diana Prince', 'diana@example.com', '2021-04-26');

-- Insert data into Orders
INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES
(1001, 1, '2023-04-26', 1245.50),
(1002, 2, '2023-10-12', 99.99),
(1003, 1, '2023-07-01', 145.00),
(1004, 3, '2023-01-14', 150.00),
(1005, 2, '2023-09-24', 120.00),
(1006, 1, '2023-06-19', 20.00);
-- Create the database
CREATE DATABASE ECommerceDB;
USE ECommerceDB;

-- 1. Create the tables

-- Categories Table
CREATE TABLE Categories (
    CategoryID INT PRIMARY KEY,
    CategoryName VARCHAR(50) NOT NULL UNIQUE
);

-- Products Table
CREATE TABLE Products (
    ProductID INT PRIMARY KEY,
    ProductName VARCHAR(100) NOT NULL UNIQUE,
    CategoryID INT,
    Price DECIMAL(10,2) NOT NULL,
    StockQuantity INT,
    FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);

-- Customers Table
CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(100) NOT NULL,
    Email VARCHAR(100) UNIQUE,
    JoinDate DATE
);

-- Orders Table
CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    OrderDate DATE NOT NULL,
    TotalAmount DECIMAL(10,2),
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);

-- 2. Insert the records into each table

-- Insert data into Categories
INSERT INTO Categories (CategoryID, CategoryName) VALUES
(1, 'Electronics'),
(2, 'Books'),
(3, 'Home Goods'),
(4, 'Apparel');

-- Insert data into Products
INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES
(101, 'Laptop Pro', 1, 1200.00, 50),
(102, 'SQL Handbook', 2, 45.50, 200),
(103, 'Smart Speaker', 1, 99.99, 150),
(104, 'Coffee Maker', 3, 75.00, 80),
(105, 'Novel : The Great SQL', 2, 25.00, 120),
(106, 'Wireless Earbuds', 1, 150.00, 100),
(107, 'Blender X', 3, 120.00, 60),
(108, 'T-Shirt Casual', 4, 20.00, 300);

-- Insert data into Customers
INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES
(1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
(2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
(3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
(4, 'Diana Prince', 'diana@example.com', '2021-04-26');

-- Insert data into Orders
INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES
(1001, 1, '2023-04-26', 1245.50),
(1002, 2, '2023-10-12', 99.99),
(1003, 1, '2023-07-01', 145.00),
(1004, 3, '2023-01-14', 150.00),
(1005, 2, '2023-09-24', 120.00),
(1006, 1, '2023-06-19', 20.00);

Question 7 : Generate a report showing CustomerName, Email, and the
TotalNumberofOrders for each customer. Include customers who have not placed
any orders, in which case their TotalNumberofOrders should be 0. Order the results
by CustomerName.

Answer: To generate the report, you can use an SQL query that performs a LEFT JOIN between the Customers and Orders tables and then uses the COUNT and COALESCE (or ISNULL) aggregate functions. This approach ensures all customers are included, even those with no corresponding orders.
Prerequisites
This query assumes you have two tables, likely named Customers and Orders, with the following relevant columns:
Customers table: CustomerID, CustomerName, Email
Orders table: OrderID, CustomerID (foreign key)
SQL Query
sql
SELECT
    c.CustomerName,
    c.Email,
    COALESCE(COUNT(o.OrderID), 0) AS TotalNumberofOrders
FROM
    Customers c
LEFT JOIN
    Orders o ON c.CustomerID = o.CustomerID
GROUP BY
    c.CustomerID, c.CustomerName, c.Email -- Group by all non-aggregated columns
ORDER BY
    c.CustomerName;

Explanation
LEFT JOIN: This is crucial. It returns all records from the left table (Customers) and the matching records from the right table (Orders). For customers without orders, the Orders columns will be NULL.
COUNT(o.OrderID): This aggregate function counts the non-NULL OrderID values for each group of customers. Customers without orders will have a count of 0 because COUNT() ignores NULL values.
COALESCE(COUNT(o.OrderID), 0): In some SQL dialects (like SQL Server), the COUNT might return NULL for no matches; COALESCE replaces any NULL result with 0 for the TotalNumberofOrders column. (In many modern SQL versions, the COUNT() function automatically handles this, but COALESCE is a safe, standard practice).
GROUP BY: Since you are using an aggregate function (COUNT()) along with non-aggregated columns (CustomerName, Email), you must include the non-aggregated columns in the GROUP BY clause. Grouping by the primary key (CustomerID) is a best practice to ensure uniqueness even if names are duplicated.
ORDER BY: This sorts the final result set by CustomerName in ascending order as requested.

Question 8 : Retrieve Product Information with Category: Write a SQL query to
display the ProductName, Price, StockQuantity, and CategoryName for all
products. Order the results by CategoryName and then ProductName alphabetically.


Answer: To retrieve the ProductName, Price, StockQuantity, and CategoryName for all products, ordered by CategoryName and then ProductName alphabetically, a JOIN operation between the Products and Categories tables is required.
Assuming the following table structures:
Products Table: ProductID, ProductName, Price, StockQuantity, CategoryID
Categories Table: CategoryID, CategoryName
The SQL query to achieve this is as follows:
Code

SELECT
    p.ProductName,
    p.Price,
    p.StockQuantity,
    c.CategoryName
FROM
    Products AS p
JOIN
    Categories AS c ON p.CategoryID = c.CategoryID
ORDER BY
    c.CategoryName ASC,
    p.ProductName ASC;

Question 9 : Write a SQL query that uses a Common Table Expression (CTE) and a
Window Function (specifically ROW_NUMBER() or RANK()) to display the
CategoryName, ProductName, and Price for the top 2 most expensive products in
each CategoryName.


Answer: Here is a SQL query that uses a Common Table Expression (CTE) and the ROW_NUMBER() window function to display the CategoryName, ProductName, and Price for the top 2 most expensive products in each CategoryName.
Code

WITH RankedProducts AS (
    SELECT
        CategoryName,
        ProductName,
        Price,
        ROW_NUMBER() OVER (PARTITION BY CategoryName ORDER BY Price DESC) AS rn
    FROM
        Products -- Assuming 'Products' is your table name
)
SELECT
    CategoryName,
    ProductName,
    Price
FROM
    RankedProducts
WHERE
    rn <= 2
ORDER BY
    CategoryName, Price DESC;
Explanation:
WITH RankedProducts AS (...): This defines a Common Table Expression (CTE) named RankedProducts.
SELECT CategoryName, ProductName, Price, ROW_NUMBER() OVER (PARTITION BY CategoryName ORDER BY Price DESC) AS rn FROM Products:
This selects the CategoryName, ProductName, and Price from your Products table.
ROW_NUMBER() OVER (PARTITION BY CategoryName ORDER BY Price DESC) is the window function.
PARTITION BY CategoryName divides the data into partitions (groups) based on the CategoryName. The ROW_NUMBER() function will reset for each new category.
ORDER BY Price DESC orders the products within each category by Price in descending order, so the most expensive products get lower row numbers.
AS rn assigns the calculated row number to a new column named rn.
SELECT CategoryName, ProductName, Price FROM RankedProducts WHERE rn <= 2 ORDER BY CategoryName, Price DESC;:
This selects the desired columns from the RankedProducts CTE.
WHERE rn <= 2 filters the results to include only the top 2 most expensive products within each category (those with rn values of 1 or 2).
ORDER BY CategoryName, Price DESC ensures the final output is ordered by category and then by price in descending order.

Question 10 : You are hired as a data analyst by Sakila Video Rentals, a global movie
rental company. The management team is looking to improve decision-making by
analyzing existing customer, rental, and inventory data.
Using the Sakila database, answer the following business questions to support key strategic
initiatives.
Tasks & Questions:
1. Identify the top 5 customers based on the total amount they’ve spent. Include customer
name, email, and total amount spent.
2. Which 3 movie categories have the highest rental counts? Display the category name
and number of times movies from that category were rented.
3. Calculate how many films are available at each store and how many of those have
never been rented.
4. Show the total revenue per month for the year 2023 to analyze business seasonality.
5. Identify customers who have rented more than 10 times in the last 6 months.


Answer: The following SQL queries provide insights into customer behavior, popular movie categories, inventory management, and revenue trends using the Sakila database. The provided data in the standard Sakila database typically covers the years 2005 and 2006, so the queries for specific dates are adjusted accordingly.
1. Identify the top 5 customers based on the total amount they’ve spent. Include customer name, email, and total amount spent.
This query joins the customer and payment tables, groups the data by customer, sums the total payment amount, and orders the results to find the top 5 highest spenders.
sql
SELECT
    c.first_name,
    c.last_name,
    c.email,
    SUM(p.amount) AS total_amount_spent
FROM
    customer AS c
JOIN
    payment AS p ON c.customer_id = p.customer_id
GROUP BY
    c.customer_id, c.first_name, c.last_name, c.email
ORDER BY
    total_amount_spent DESC
LIMIT 5;
2. Which 3 movie categories have the highest rental counts? Display the category name and number of times movies from that category were rented.
This query joins the category, film_category, inventory, and rental tables to count rentals per category, ordering by the rental count to find the top 3.
sql
SELECT
    cat.name AS category_name,
    COUNT(r.rental_id) AS rental_count
FROM
    category AS cat
JOIN
    film_category AS fc ON cat.category_id = fc.category_id
JOIN
    inventory AS i ON fc.film_id = i.film_id
JOIN
    rental AS r ON i.inventory_id = r.inventory_id
GROUP BY
    cat.name
ORDER BY
    rental_count DESC
LIMIT 3;
3. Calculate how many films are available at each store and how many of those have never been rented.
This query uses subqueries and conditional aggregation to count total inventory items at each store and the number of items that have no corresponding rental record (never rented).
sql
SELECT
    s.store_id,
    COUNT(i.inventory_id) AS total_films_in_inventory,
    COUNT(CASE WHEN r.rental_id IS NULL THEN i.inventory_id ELSE NULL END) AS never_rented_films_count
FROM
    store AS s
JOIN
    inventory AS i ON s.store_id = i.store_id
LEFT JOIN
    rental AS r ON i.inventory_id = r.inventory_id
GROUP BY
    s.store_id
ORDER BY
    s.store_id;
4. Show the total revenue per month for the relevant year to analyze business seasonality.
The standard Sakila database data is primarily from 2005, so the query analyzes that year for seasonality. It extracts the month and year from the payment_date and sums the amounts.
sql
SELECT
    EXTRACT(YEAR FROM payment_date) AS rental_year,
    EXTRACT(MONTH FROM payment_date) AS rental_month,
    SUM(amount) AS monthly_revenue
FROM
    payment
WHERE
    EXTRACT(YEAR FROM payment_date) = 2005 -- Adjust year as needed for your specific dataset
GROUP BY
    rental_year, rental_month
ORDER BY
    rental_year, rental_month;
5. Identify customers who have rented more than 10 times in the last 6 months.
Given that the data is static (mostly from 2005-2006), the "last 6 months" is calculated relative to the latest rental_date in the database.
sql
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    COUNT(r.rental_id) AS rentals_in_last_6_months
FROM
    customer AS c
JOIN
    rental AS r ON c.customer_id = r.customer_id
WHERE
    r.rental_date >= (SELECT DATE_SUB(MAX(rental_date), INTERVAL 6 MONTH) FROM rental)
GROUP BY
    c.customer_id, c.first_name, c.last_name
HAVING
    COUNT(r.rental_id) > 10
ORDER BY
    rentals_in_last_6_months DESC;